standards/sru/resources/recordUpdateExamples/example3.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<ucp:updateRequest xmlns:srw="http://lcnetdev.github.io/zing/srw/" xmlns:ucp="http://lcnetdev.github.io/zing/srw/update/">
			<srw:version>1.0</srw:version>
			<ucp:action>info:srw/action/1/replace</ucp:action>
			<ucp:recordIdentifier>123123933</ucp:recordIdentifier>
			<srw:record>
				<srw:recordPacking>xml</srw:recordPacking>
				<srw:recordSchema>info:srw/schema/1/marcxml-v1.1</srw:recordSchema>
				<srw:recordData>
					<mx:record xmlns:mx="http://lcnetdev.github.io/MARC21/slim">
						<mx:leader>     cam a22      i 4500</mx:leader>
						<mx:controlfield tag="001">123123933</mx:controlfield>
						<mx:controlfield tag="003">PICA</mx:controlfield>
						<mx:controlfield tag="005">20070821100254.0</mx:controlfield>
						<mx:controlfield tag="008">070619s2007    lu            000 0 eng d</mx:controlfield>
						<mx:datafield tag="020" ind1=" " ind2=" ">
							<mx:subfield code="a">9789279048050</mx:subfield>
						</mx:datafield>
						<mx:datafield tag="020" ind1=" " ind2=" ">
							<mx:subfield code="z">9279048050</mx:subfield>
						</mx:datafield>
						<mx:datafield tag="029" ind1="1" ind2=" ">
							<mx:subfield code="a">NLGGC</mx:subfield>
							<mx:subfield code="b">303360607</mx:subfield>
						</mx:datafield>
						<mx:datafield tag="040" ind1=" " ind2=" ">
							<mx:subfield code="a">NLGGC</mx:subfield>
							<mx:subfield code="b">dut</mx:subfield>
							<mx:subfield code="c">NLGGC</mx:subfield>
							<mx:subfield code="e">fobidrtb</mx:subfield>
						</mx:datafield>
						<mx:datafield tag="084" ind1=" " ind2=" ">
							<mx:subfield code="a">02.14</mx:subfield>
							<mx:subfield code="2">bcl</mx:subfield>
						</mx:datafield>
						<mx:datafield tag="245" ind1="1" ind2="0">
							<mx:subfield code="a">FP7 in brief :</mx:subfield>
							<mx:subfield code="b">how to get involved in the EU 7th Framework Programme for Research.</mx:subfield>
						</mx:datafield>
						<mx:datafield tag="260" ind1=" " ind2=" ">
							<mx:subfield code="a">Luxembourg :</mx:subfield>
							<mx:subfield code="b">Office for Official Publications of the European Comunities,</mx:subfield>
							<mx:subfield code="c">2007.</mx:subfield>
						</mx:datafield>
						<mx:datafield tag="300" ind1=" " ind2=" ">
							<mx:subfield code="a">31 p. :</mx:subfield>
							<mx:subfield code="b">ill. ;</mx:subfield>
							<mx:subfield code="c">15 cm.</mx:subfield>
						</mx:datafield>
						<mx:datafield tag="500" ind1=" " ind2=" ">
							<mx:subfield code="a">Titel op omslag. - Op omslag tevens de vermelding: a pocket guide for newcomers.</mx:subfield>
						</mx:datafield>
						<mx:datafield tag="500" ind1=" " ind2=" ">
							<mx:subfield code="a">Cat. nr.: KI-77-07-031-EN-C.</mx:subfield>
						</mx:datafield>
						<mx:datafield tag="504" ind1=" " ind2=" ">
							<mx:subfield code="a">Lit.opg.</mx:subfield>
						</mx:datafield>
						<mx:datafield tag="650" ind1="1" ind2="7">
							<mx:subfield code="a">Subsidies.</mx:subfield>
							<mx:subfield code="2">gtt</mx:subfield>
						</mx:datafield>
						<mx:datafield tag="650" ind1="1" ind2="7">
							<mx:subfield code="a">Onderzoek.</mx:subfield>
							<mx:subfield code="2">gtt</mx:subfield>
						</mx:datafield>
						<mx:datafield tag="651" ind1=" " ind2="7">
							<mx:subfield code="a">EU-landen.</mx:subfield>
							<mx:subfield code="2">gtt</mx:subfield>
						</mx:datafield>
						<mx:datafield tag="691" ind1=" " ind2=" ">
							<mx:subfield code="a">organisatie van wetenschap en cultuur.</mx:subfield>
						</mx:datafield>
						<mx:datafield tag="710" ind1="2" ind2=" ">
							<mx:subfield code="a">European Commission.</mx:subfield>
							<mx:subfield code="b">Community Research.</mx:subfield>
						</mx:datafield>
						<mx:datafield tag="949" ind1=" " ind2=" ">
							<mx:subfield code="l">KOB</mx:subfield>
						</mx:datafield>
					</mx:record>
				</srw:recordData>
			</srw:record>
		</ucp:updateRequest>
	</soap:Body>
</soap:Envelope>
